// =============================================================================
// AB_Exp.js
// Version: 0.01
// -----------------------------------------------------------------------------
// Copyright (c) 2017 ヱビ
// Released under the MIT license
// http://opensource.org/licenses/mit-license.php
// -----------------------------------------------------------------------------
// [Homepage]: ヱビのノート
//             http://www.zf.em-net.ne.jp/~ebi-games/
// =============================================================================


/*:
 * @plugindesc 手に入る経験値を設定できます。
 * @author ヱビ
 * 
 * @param expformula
 * @desc 経験値の計算式です。
 * @default exp
 * 
 * @help
 * ============================================================================
 * どんなプラグイン？
 * ============================================================================
 * 
 * プラグインパラメータで経験値の式を設定できます。
 * 
 * ============================================================================
 * 更新履歴
 * ============================================================================
 * 
 * Version 0.01
 * 
 * ============================================================================
 * 利用規約
 * ============================================================================
 * 
 * ・MITライセンスです。
 * ・クレジット表記は不要
 * ・営利目的で使用可
 * ・改変可
 *     ただし、ソースコードのヘッダのライセンス表示は残してください。
 * ・素材だけの再配布も可
 * ・アダルトゲーム、残酷なゲームでの使用も可
 * 
 */

(function() {
	var parameters = PluginManager.parameters('AB_Exp');
	var expformula = (parameters['expformula']);

//=============================================================================
// Game_Actor
//=============================================================================

	var _Game_Actor_prototype_gainExp = Game_Actor.prototype.gainExp;
	Game_Actor.prototype.gainExp = function(exp) {
		var user = this;
		var v = $gameVariables._data;
		exp = eval(expformula);
		_Game_Actor_prototype_gainExp.call(this, exp);
	};




})();